#+begin_src http :pretty
POST https://graph.facebook.com/897778120337543/subscribed_apps?subscribed_fields=leadgen&access_token=EAAXz7PtnpLgBAN3ZBhGZBZCZC9eS4xFell1ktcJZBKP8hfQUKWJU3dXPHCnwZAeryrQIposPCQqMDwznnV6TpGK5VYJBYDRDlT1O3iXD2wykEBRnEH4Xeyk3DzFBwAkDB0eLghjN2lbtZAQJnC5FzZA4gSmc7SeKhSSigGYZB4DiaRwZDZD
#+end_src

#+RESULTS:
: {
:   "success": true
: }

#+begin_src http :pretty
GET https://graph.facebook.com/897778120337543/leadgen_forms?access_token=EAAXz7PtnpLgBAPO0Szn8etjKAKipkiebWqW20kt9I5JRy7dESPESMfv7hYwyF5wV8TacksT4T9xJ9pRqiBwF5CwDZBaovpZC9TPrgn01HW7xZAQScrCc2jmetjGP89sU3UrDfMhZBHcyRZBGmkYWZCHbAVscB9HzsFjJGh3ZAb0SAZDZD
#+end_src

#+RESULTS:
#+begin_example
{
  "data": [
    {
      "id": "301263814302071",
      "locale": "en_US",
      "name": "Basic",
      "status": "ACTIVE"
    }
  ],
  "paging": {
    "cursors": {
      "before": "QVFIUklMZAnN6ZAXVEYkRKenRSdTc4X2lrMnNzZAVBjU0N5MEduYjRZAYUpDbkhTTy1RbEhHVGJOcElTdFRWSXhZAUjg5ekNvejFhTEVueUpXSUVIUUVZAbEVBRElB",
      "after": "QVFIUklMZAnN6ZAXVEYkRKenRSdTc4X2lrMnNzZAVBjU0N5MEduYjRZAYUpDbkhTTy1RbEhHVGJOcElTdFRWSXhZAUjg5ekNvejFhTEVueUpXSUVIUUVZAbEVBRElB"
    }
  }
}
#+end_example

#+begin_src http :pretty
POST https://socialdistancing.onl/webhook
Content-Type: application.json

{"foo": "bar"}
#+end_src

#+RESULTS:
: {
:   "ok": true
: }

#+begin_src http
GET https://www.facebook.com/ads/lead_gen/export_csv/?id=301263814302071&type=form&access_token=EAAXz7PtnpLgBAPO0Szn8etjKAKipkiebWqW20kt9I5JRy7dESPESMfv7hYwyF5wV8TacksT4T9xJ9pRqiBwF5CwDZBaovpZC9TPrgn01HW7xZAQScrCc2jmetjGP89sU3UrDfMhZBHcyRZBGmkYWZCHbAVscB9HzsFjJGh3ZAb0SAZDZD
#+end_src

#+RESULTS:

#+begin_src http :pretty
GET https://api.callrail.com/v3/a/203306511/companies.json
Authorization: Token token=aa6ed5c8c7f90b51beb930d3a133e257
#+end_src

#+RESULTS:
#+begin_example
{
  "page": 1,
  "per_page": 100,
  "total_pages": 1,
  "total_records": 2,
  "companies": [
    {
      "id": "COMd40f91d8068d4986b075d3bbe768bd48",
      "name": "S32",
      "status": "active",
      "time_zone": "Asia/Bangkok",
      "created_at": "2020-08-14T12:04:47.496Z",
      "disabled_at": null,
      "script_url": "//cdn.callrail.com/companies/530060226/212b5b5b2ca17fc7060a/12/swap.js",
      "callscore_enabled": false,
      "lead_scoring_enabled": true,
      "swap_exclude_jquery": null,
      "swap_ppc_override": null,
      "swap_landing_override": null,
      "swap_cookie_duration": 365,
      "callscribe_enabled": false,
      "keyword_spotting_enabled": false
    },
    {
      "id": "COM42597a7115554859a5f751beb77e55bc",
      "name": "S23",
      "status": "active",
      "time_zone": "Asia/Bangkok",
      "created_at": "2020-08-14T14:29:31.440Z",
      "disabled_at": null,
      "script_url": "//cdn.callrail.com/companies/527027944/697f51052a86ff149720/12/swap.js",
      "callscore_enabled": false,
      "lead_scoring_enabled": true,
      "swap_exclude_jquery": null,
      "swap_ppc_override": null,
      "swap_landing_override": null,
      "swap_cookie_duration": 365,
      "callscribe_enabled": false,
      "keyword_spotting_enabled": false
    }
  ]
}
#+end_example

#+begin_src http :pretty
POST https://api.callrail.com/v3/a/203306511/form_submissions.json
Authorization: Token token=aa6ed5c8c7f90b51beb930d3a133e257
Content-Type: application/json

{
  "form_submission": {
    "company_id": "COM42597a7115554859a5f751beb77e55bc",
    "referrer": "https://facebook.com",
    "referring_url": "https://www.facebook.com/s23portal",
    "landing_page_url": "https://www.facebook.com/s23portal",
    "form_url": "https://www.facebook.com/s23portal",
    "form_data": {
      "email": "me@tungdao.com",
      "fullname": "Tung Dao",
      "phone_number": "+84 89 858 91 02",
      "job_title": "Chief Technology Officer (CTO)"
    }
  }
}
#+end_src

#+RESULTS:
#+begin_example
{
  "id": "FRM12f60257084c4ba1a4f3c8dcc9d697b6",
  "company_id": "COM42597a7115554859a5f751beb77e55bc",
  "person_id": "PER937ee23111e44242bff97cc88e86bc15",
  "form_data": {
    "email": "me@tungdao.com",
    "fullname": "Tung Dao",
    "phone_number": "+84 89 858 91 02",
    "job_title": "Chief Technology Officer (CTO)"
  },
  "form_url": "https://www.facebook.com/s23portal",
  "landing_page_url": "https://www.facebook.com/s23portal",
  "referrer": "https://facebook.com",
  "referring_url": "https://www.facebook.com/s23portal",
  "submitted_at": "2020-08-14T10:36:00.288-04:00",
  "first_form": false
}
#+end_example
